joaoantoniocardoso/stm32f4_softcomp/system/src/Components/wm5102/wm5102_register_map.h
#define WM5102_REG_SOFTWARE_RESET                                         0x0000
#define WM5102_REG_DEVICE_REVISION                                        0x0001
#define WM5102_REG_CTRL_IF_SPI_CFG_1                                      0x0008
#define WM5102_REG_CTRL_IF_I2C1_CFG_1                                     0x0009
#define WM5102_REG_WRITE_SEQUENCER_CTRL_0                                 0x0016
#define WM5102_REG_WRITE_SEQUENCER_CTRL_1                                 0x0017
#define WM5102_REG_WRITE_SEQUENCER_CTRL_2                                 0x0018
#define WM5102_REG_TONE_GENERATOR_1                                       0x0020
#define WM5102_REG_TONE_GENERATOR_2                                       0x0021
#define WM5102_REG_TONE_GENERATOR_3                                       0x0022
#define WM5102_REG_TONE_GENERATOR_4                                       0x0023
#define WM5102_REG_TONE_GENERATOR_5                                       0x0024
#define WM5102_REG_PWM_DRIVE_1                                            0x0030
#define WM5102_REG_PWM_DRIVE_2                                            0x0031
#define WM5102_REG_PWM_DRIVE_3                                            0x0032
#define WM5102_REG_WAKE_CONTROL                                           0x0040
#define WM5102_REG_SEQUENCE_CONTROL                                       0x0041
#define WM5102_REG_SAMPLE_RATE_SEQUENCE_SELECT_1                          0x0061
#define WM5102_REG_SAMPLE_RATE_SEQUENCE_SELECT_2                          0x0062
#define WM5102_REG_SAMPLE_RATE_SEQUENCE_SELECT_3                          0x0063
#define WM5102_REG_SAMPLE_RATE_SEQUENCE_SELECT_4                          0x0064
#define WM5102_REG_ALWAYS_ON_TRIGGERS_SEQUENCE_SELECT_1                   0x0066
#define WM5102_REG_ALWAYS_ON_TRIGGERS_SEQUENCE_SELECT_2                   0x0067
#define WM5102_REG_ALWAYS_ON_TRIGGERS_SEQUENCE_SELECT_3                   0x0068
#define WM5102_REG_ALWAYS_ON_TRIGGERS_SEQUENCE_SELECT_4                   0x0069
#define WM5102_REG_ALWAYS_ON_TRIGGERS_SEQUENCE_SELECT_5                   0x006a
#define WM5102_REG_ALWAYS_ON_TRIGGERS_SEQUENCE_SELECT_6                   0x006b
#define WM5102_REG_TRIGGER_SEQUENCE_SELECT_32                             0x006e
#define WM5102_REG_TRIGGER_SEQUENCE_SELECT_33                             0x006f
#define WM5102_REG_COMFORT_NOISE_GENERATOR                                0x0070
#define WM5102_REG_HAPTICS_CONTROL_1                                      0x0090
#define WM5102_REG_HAPTICS_CONTROL_2                                      0x0091
#define WM5102_REG_HAPTICS_PHASE_1_INTENSITY                              0x0092
#define WM5102_REG_HAPTICS_PHASE_1_DURATION                               0x0093
#define WM5102_REG_HAPTICS_PHASE_2_INTENSITY                              0x0094
#define WM5102_REG_HAPTICS_PHASE_2_DURATION                               0x0095
#define WM5102_REG_HAPTICS_PHASE_3_INTENSITY                              0x0096
#define WM5102_REG_HAPTICS_PHASE_3_DURATION                               0x0097
#define WM5102_REG_HAPTICS_STATUS                                         0x0098
#define WM5102_REG_CLOCK_32K_1                                            0x0100
#define WM5102_REG_SYSTEM_CLOCK_1                                         0x0101
#define WM5102_REG_SAMPLE_RATE_1                                          0x0102
#define WM5102_REG_SAMPLE_RATE_2                                          0x0103
#define WM5102_REG_SAMPLE_RATE_3                                          0x0104
#define WM5102_REG_SAMPLE_RATE_1_STATUS                                   0x010a
#define WM5102_REG_SAMPLE_RATE_2_STATUS                                   0x010b
#define WM5102_REG_SAMPLE_RATE_3_STATUS                                   0x010c
#define WM5102_REG_ASYNC_CLOCK_1                                          0x0112
#define WM5102_REG_ASYNC_SAMPLE_RATE_1                                    0x0113
#define WM5102_REG_ASYNC_SAMPLE_RATE_2                                    0x0114
#define WM5102_REG_ASYNC_SAMPLE_RATE_1_STATUS                             0x011b
#define WM5102_REG_ASYNC_SAMPLE_RATE_2_STATUS                             0x011b
#define WM5102_REG_OUTPUT_SYSTEM_CLOCK                                    0x0149
#define WM5102_REG_OUTPUT_ASYNC_CLOCK                                     0x014a
#define WM5102_REG_RATE_ESTIMATOR_1                                       0x0152
#define WM5102_REG_RATE_ESTIMATOR_2                                       0x0153
#define WM5102_REG_RATE_ESTIMATOR_3                                       0x0154
#define WM5102_REG_RATE_ESTIMATOR_4                                       0x0155
#define WM5102_REG_RATE_ESTIMATOR_5                                       0x0156
#define WM5102_REG_DYNAMIC_FREQUENCY_SCALING_1                            0x0161
#define WM5102_REG_FLL1_CONTROL_1                                         0x0171
#define WM5102_REG_FLL1_CONTROL_2                                         0x0172
#define WM5102_REG_FLL1_CONTROL_3                                         0x0173
#define WM5102_REG_FLL1_CONTROL_4                                         0x0174
#define WM5102_REG_FLL1_CONTROL_5                                         0x0175
#define WM5102_REG_FLL1_CONTROL_6                                         0x0176
#define WM5102_REG_FLL1_CONTROL_7                                         0x0179
#define WM5102_REG_FLL1_SYNCHRONISER_1                                    0x0181
#define WM5102_REG_FLL1_SYNCHRONISER_2                                    0x0182
#define WM5102_REG_FLL1_SYNCHRONISER_3                                    0x0183
#define WM5102_REG_FLL1_SYNCHRONISER_4                                    0x0184
#define WM5102_REG_FLL1_SYNCHRONISER_5                                    0x0185
#define WM5102_REG_FLL1_SYNCHRONISER_6                                    0x0186
#define WM5102_REG_FLL1_SYNCHRONISER_7                                    0x0187
#define WM5102_REG_FLL1_SPREAD_SPECTRUM                                   0x0189
#define WM5102_REG_FLL1_GPIO_CLOCK                                        0x018a
#define WM5102_REG_FLL2_CONTROL_1                                         0x0191
#define WM5102_REG_FLL2_CONTROL_2                                         0x0192
#define WM5102_REG_FLL2_CONTROL_3                                         0x0193
#define WM5102_REG_FLL2_CONTROL_4                                         0x0194
#define WM5102_REG_FLL2_CONTROL_5                                         0x0195
#define WM5102_REG_FLL2_CONTROL_6                                         0x0196
#define WM5102_REG_FLL2_CONTROL_7                                         0x0199
#define WM5102_REG_FLL2_SYNCHRONISER_1                                    0x01a1
#define WM5102_REG_FLL2_SYNCHRONISER_2                                    0x01a2
#define WM5102_REG_FLL2_SYNCHRONISER_3                                    0x01a3
#define WM5102_REG_FLL2_SYNCHRONISER_4                                    0x01a4
#define WM5102_REG_FLL2_SYNCHRONISER_5                                    0x01a5
#define WM5102_REG_FLL2_SYNCHRONISER_6                                    0x01a6
#define WM5102_REG_FLL2_SYNCHRONISER_7                                    0x01a7
#define WM5102_REG_FLL2_SPREAD_SPECTRUM                                   0x01a9
#define WM5102_REG_FLL2_GPIO_CLOCK                                        0x01aa
#define WM5102_REG_MIC_CHARGE_PUMP_1                                      0x0200
#define WM5102_REG_LDO1_CONTROL_1                                         0x0210
#define WM5102_REG_LDO1_CONTROL_2                                         0x0212
#define WM5102_REG_LDO2_CONTROL_1                                         0x0213
#define WM5102_REG_MIC_BIAS_CTRL_1                                        0x0218
#define WM5102_REG_MIC_BIAS_CTRL_2                                        0x0219
#define WM5102_REG_MIC_BIAS_CTRL_3                                        0x021a
#define WM5102_REG_ACCESSORY_DETECT_MODE_1                                0x0293
#define WM5102_REG_HEADPHONE_DETECT_1                                     0x029b
#define WM5102_REG_HEADPHONE_DETECT_2                                     0x029c
#define WM5102_REG_MICD_CLAMP_CONTROL                                     0x02a2
#define WM5102_REG_MIC_DETECT_1                                           0x02a3
#define WM5102_REG_MIC_DETECT_2                                           0x02a4
#define WM5102_REG_MIC_DETECT_3                                           0x02a5
#define WM5102_REG_MIC_NOISE_MIX_CONTROL_1                                0x02c3
#define WM5102_REG_ISOLATION_CONTROL                                      0x02cb
#define WM5102_REG_JACK_DETECT_ANALOGUE                                   0x02d3
#define WM5102_REG_INPUT_ENABLES                                          0x0300
#define WM5102_REG_INPUT_ENABLES_STATUS                                   0x0301
#define WM5102_REG_INPUT_RATE                                             0x0308
#define WM5102_REG_INPUT_VOLUME_RAMP                                      0x0309
#define WM5102_REG_IN1L_CONTROL                                           0x0310
#define WM5102_REG_ADC_DIGITAL_VOLUME_1L                                  0x0311
#define WM5102_REG_DMIC1L_CONTROL                                         0x0312
#define WM5102_REG_IN1R_CONTROL                                           0x0314
#define WM5102_REG_ADC_DIGITAL_VOLUME_1R                                  0x0315
#define WM5102_REG_DMIC1R_CONTROL                                         0x0316
#define WM5102_REG_IN2L_CONTROL                                           0x0318
#define WM5102_REG_ADC_DIGITAL_VOLUME_2L                                  0x0319
#define WM5102_REG_DMIC2L_CONTROL                                         0x031a
#define WM5102_REG_IN2R_CONTROL                                           0x031c
#define WM5102_REG_ADC_DIGITAL_VOLUME_2R                                  0x031d
#define WM5102_REG_DMIC2R_CONTROL                                         0x031e
#define WM5102_REG_IN3L_CONTROL                                           0x0320
#define WM5102_REG_ADC_DIGITAL_VOLUME_3L                                  0x0321
#define WM5102_REG_DMIC3L_CONTROL                                         0x0322
#define WM5102_REG_IN3R_CONTROL                                           0x0324
#define WM5102_REG_ADC_DIGITAL_VOLUME_3R                                  0x0325
#define WM5102_REG_DMIC3R_CONTROL                                         0x0326
#define WM5102_REG_OUTPUT_ENABLES_1                                       0x0400
#define WM5102_REG_OUTPUT_STATUS_1                                        0x0401
#define WM5102_REG_RAW_OUTPUT_STATUS_1                                    0x0406
#define WM5102_REG_OUTPUT_RATE_1                                          0x0408
#define WM5102_REG_OUTPUT_VOLUME_RAMP                                     0x0409
#define WM5102_REG_OUTPUT_PATH_CONFIG_1L                                  0x0410
#define WM5102_REG_DAC_DIGITAL_VOLUME_1L                                  0x0411
#define WM5102_REG_DAC_VOLUME_LIMIT_1L                                    0x0412
#define WM5102_REG_NOISE_GATE_SELECT_1L                                   0x0413
#define WM5102_REG_OUTPUT_PATH_CONFIG_1R                                  0x0414
#define WM5102_REG_DAC_DIGITAL_VOLUME_1R                                  0x0415
#define WM5102_REG_DAC_VOLUME_LIMIT_1R                                    0x0416
#define WM5102_REG_NOISE_GATE_SELECT_1R                                   0x0417
#define WM5102_REG_OUTPUT_PATH_CONFIG_2L                                  0x0418
#define WM5102_REG_DAC_DIGITAL_VOLUME_2L                                  0x0419
#define WM5102_REG_DAC_VOLUME_LIMIT_2L                                    0x041a
#define WM5102_REG_NOISE_GATE_SELECT_2L                                   0x041b
#define WM5102_REG_OUTPUT_PATH_CONFIG_2R                                  0x041c
#define WM5102_REG_DAC_DIGITAL_VOLUME_2R                                  0x041d
#define WM5102_REG_DAC_VOLUME_LIMIT_2R                                    0x041e
#define WM5102_REG_NOISE_GATE_SELECT_2R                                   0x041f
#define WM5102_REG_OUTPUT_PATH_CONFIG_3L                                  0x0420
#define WM5102_REG_DAC_DIGITAL_VOLUME_3L                                  0x0421
#define WM5102_REG_DAC_VOLUME_LIMIT_3L                                    0x0422
#define WM5102_REG_NOISE_GATE_SELECT_3L                                   0x0423
#define WM5102_REG_OUTPUT_PATH_CONFIG_4L                                  0x0428
#define WM5102_REG_DAC_DIGITAL_VOLUME_4L                                  0x0429
#define WM5102_REG_OUT_VOLUME_4L                                          0x042a
#define WM5102_REG_NOISE_GATE_SELECT_4L                                   0x042b
#define WM5102_REG_DAC_DIGITAL_VOLUME_4R                                  0x042d
#define WM5102_REG_OUT_VOLUME_4R                                          0x042e
#define WM5102_REG_NOISE_GATE_SELECT_4R                                   0x042f
#define WM5102_REG_OUTPUT_PATH_CONFIG_5L                                  0x0430
#define WM5102_REG_DAC_DIGITAL_VOLUME_5L                                  0x0431
#define WM5102_REG_DAC_VOLUME_LIMIT_5L                                    0x0432
#define WM5102_REG_NOISE_GATE_SELECT_5L                                   0x0433
#define WM5102_REG_DAC_DIGITAL_VOLUME_5R                                  0x0435
#define WM5102_REG_DAC_VOLUME_LIMIT_5R                                    0x0436
#define WM5102_REG_NOISE_GATE_SELECT_5R                                   0x0437
#define WM5102_REG_DAC_AEC_CONTROL_1                                      0x0450
#define WM5102_REG_NOISE_GATE_CONTROL                                     0x0458
#define WM5102_REG_PDM_SPK1_CTRL_1                                        0x0490
#define WM5102_REG_PDM_SPK1_CTRL_2                                        0x0491
#define WM5102_REG_AIF1_BCLK_CTRL                                         0x0500
#define WM5102_REG_AIF1_TX_PIN_CTRL                                       0x0501
#define WM5102_REG_AIF1_RX_PIN_CTRL                                       0x0502
#define WM5102_REG_AIF1_RATE_CTRL                                         0x0503
#define WM5102_REG_AIF1_FORMAT                                            0x0504
#define WM5102_REG_AIF1_TX_BCLK_RATE                                      0x0505
#define WM5102_REG_AIF1_RX_BCLK_RATE                                      0x0506
#define WM5102_REG_AIF1_FRAME_CTRL_1                                      0x0507
#define WM5102_REG_AIF1_FRAME_CTRL_2                                      0x0508
#define WM5102_REG_AIF1_FRAME_CTRL_3                                      0x0509
#define WM5102_REG_AIF1_FRAME_CTRL_4                                      0x050a
#define WM5102_REG_AIF1_FRAME_CTRL_5                                      0x050b
#define WM5102_REG_AIF1_FRAME_CTRL_6                                      0x050c
#define WM5102_REG_AIF1_FRAME_CTRL_7                                      0x050d
#define WM5102_REG_AIF1_FRAME_CTRL_8                                      0x050e
#define WM5102_REG_AIF1_FRAME_CTRL_9                                      0x050f
#define WM5102_REG_AIF1_FRAME_CTRL_10                                     0x0510
#define WM5102_REG_AIF1_FRAME_CTRL_11                                     0x0511
#define WM5102_REG_AIF1_FRAME_CTRL_12                                     0x0512
#define WM5102_REG_AIF1_FRAME_CTRL_13                                     0x0513
#define WM5102_REG_AIF1_FRAME_CTRL_14                                     0x0514
#define WM5102_REG_AIF1_FRAME_CTRL_15                                     0x0515
#define WM5102_REG_AIF1_FRAME_CTRL_16                                     0x0516
#define WM5102_REG_AIF1_FRAME_CTRL_17                                     0x0517
#define WM5102_REG_AIF1_FRAME_CTRL_18                                     0x0518
#define WM5102_REG_AIF1_TX_ENABLES                                        0x0519
#define WM5102_REG_AIF1_RX_ENABLES                                        0x051a
#define WM5102_REG_AIF2_BCLK_CTRL                                         0x0540
#define WM5102_REG_AIF2_TX_PIN_CTRL                                       0x0541
#define WM5102_REG_AIF2_RX_PIN_CTRL                                       0x0542
#define WM5102_REG_AIF2_RATE_CTRL                                         0x0543
#define WM5102_REG_AIF2_FORMAT                                            0x0544
#define WM5102_REG_AIF2_TX_BCLK_RATE                                      0x0545
#define WM5102_REG_AIF2_RX_BCLK_RATE                                      0x0546
#define WM5102_REG_AIF2_FRAME_CTRL_1                                      0x0547
#define WM5102_REG_AIF2_FRAME_CTRL_2                                      0x0548
#define WM5102_REG_AIF2_FRAME_CTRL_3                                      0x0549
#define WM5102_REG_AIF2_FRAME_CTRL_4                                      0x054a
#define WM5102_REG_AIF2_FRAME_CTRL_11                                     0x0551
#define WM5102_REG_AIF2_FRAME_CTRL_12                                     0x0552
#define WM5102_REG_AIF2_TX_ENABLES                                        0x0559
#define WM5102_REG_AIF2_RX_ENABLES                                        0x055a
#define WM5102_REG_AIF3_BCLK_CTRL                                         0x0580
#define WM5102_REG_AIF3_TX_PIN_CTRL                                       0x0581
#define WM5102_REG_AIF3_RX_PIN_CTRL                                       0x0582
#define WM5102_REG_AIF3_RATE_CTRL                                         0x0583
#define WM5102_REG_AIF3_FORMAT                                            0x0584
#define WM5102_REG_AIF3_TX_BCLK_RATE                                      0x0585
#define WM5102_REG_AIF3_RX_BCLK_RATE                                      0x0586
#define WM5102_REG_AIF3_FRAME_CTRL_1                                      0x0587
#define WM5102_REG_AIF3_FRAME_CTRL_2                                      0x0588
#define WM5102_REG_AIF3_FRAME_CTRL_3                                      0x0589
#define WM5102_REG_AIF3_FRAME_CTRL_4                                      0x058a
#define WM5102_REG_AIF3_FRAME_CTRL_11                                     0x0591
#define WM5102_REG_AIF3_FRAME_CTRL_12                                     0x0592
#define WM5102_REG_AIF3_TX_ENABLES                                        0x0599
#define WM5102_REG_AIF3_RX_ENABLES                                        0x059a
#define WM5102_REG_SLIMBUS_FRAMER_REF_GEAR                                0x05e3
#define WM5102_REG_SLIMBUS_RATES_1                                        0x05e5
#define WM5102_REG_SLIMBUS_RATES_2                                        0x05e6
#define WM5102_REG_SLIMBUS_RATES_3                                        0x05e7
#define WM5102_REG_SLIMBUS_RATES_4                                        0x05e8
#define WM5102_REG_SLIMBUS_RATES_5                                        0x05e9
#define WM5102_REG_SLIMBUS_RATES_6                                        0x05ea
#define WM5102_REG_SLIMBUS_RATES_7                                        0x05eb
#define WM5102_REG_SLIMBUS_RATES_8                                        0x05ec
#define WM5102_REG_SLIMBUS_RX_CHANNEL_ENABLE                              0x05f5
#define WM5102_REG_SLIMBUS_TX_CHANNEL_ENABLE                              0x05f6
#define WM5102_REG_SLIMBUS_RX_PORT_STATUS                                 0x05f7
#define WM5102_REG_SLIMBUS_TX_PORT_STATUS                                 0x05f8
#define WM5102_REG_PWM1MIX_INPUT_1_SOURCE                                 0x0640
#define WM5102_REG_PWM1MIX_INPUT_1_VOLUME                                 0x0641
#define WM5102_REG_PWM1MIX_INPUT_2_SOURCE                                 0x0642
#define WM5102_REG_PWM1MIX_INPUT_2_VOLUME                                 0x0643
#define WM5102_REG_PWM1MIX_INPUT_3_SOURCE                                 0x0644
#define WM5102_REG_PWM1MIX_INPUT_3_VOLUME                                 0x0645
#define WM5102_REG_PWM1MIX_INPUT_4_SOURCE                                 0x0646
#define WM5102_REG_PWM1MIX_INPUT_4_VOLUME                                 0x0647
#define WM5102_REG_PWM2MIX_INPUT_1_SOURCE                                 0x0648
#define WM5102_REG_PWM2MIX_INPUT_1_VOLUME                                 0x0649
#define WM5102_REG_PWM2MIX_INPUT_2_SOURCE                                 0x064a
#define WM5102_REG_PWM2MIX_INPUT_2_VOLUME                                 0x064b
#define WM5102_REG_PWM2MIX_INPUT_3_SOURCE                                 0x064c
#define WM5102_REG_PWM2MIX_INPUT_3_VOLUME                                 0x064d
#define WM5102_REG_PWM2MIX_INPUT_4_SOURCE                                 0x064e
#define WM5102_REG_PWM2MIX_INPUT_4_VOLUME                                 0x064f
#define WM5102_REG_MICMIX_INPUT_1_SOURCE                                  0x0660
#define WM5102_REG_MICMIX_INPUT_1_VOLUME                                  0x0661
#define WM5102_REG_MICMIX_INPUT_2_SOURCE                                  0x0662
#define WM5102_REG_MICMIX_INPUT_2_VOLUME                                  0x0663
#define WM5102_REG_MICMIX_INPUT_3_SOURCE                                  0x0664
#define WM5102_REG_MICMIX_INPUT_3_VOLUME                                  0x0665
#define WM5102_REG_MICMIX_INPUT_4_SOURCE                                  0x0666
#define WM5102_REG_MICMIX_INPUT_4_VOLUME                                  0x0667
#define WM5102_REG_NOISEMIX_INPUT_1_SOURCE                                0x0668
#define WM5102_REG_NOISEMIX_INPUT_1_VOLUME                                0x0669
#define WM5102_REG_NOISEMIX_INPUT_2_SOURCE                                0x066a
#define WM5102_REG_NOISEMIX_INPUT_2_VOLUME                                0x066b
#define WM5102_REG_NOISEMIX_INPUT_3_SOURCE                                0x066c
#define WM5102_REG_NOISEMIX_INPUT_3_VOLUME                                0x066d
#define WM5102_REG_NOISEMIX_INPUT_4_SOURCE                                0x066e
#define WM5102_REG_NOISEMIX_INPUT_4_VOLUME                                0x066f
#define WM5102_REG_OUT1LMIX_INPUT_1_SOURCE                                0x0680
#define WM5102_REG_OUT1LMIX_INPUT_1_VOLUME                                0x0681
#define WM5102_REG_OUT1LMIX_INPUT_2_SOURCE                                0x0682
#define WM5102_REG_OUT1LMIX_INPUT_2_VOLUME                                0x0683
#define WM5102_REG_OUT1LMIX_INPUT_3_SOURCE                                0x0684
#define WM5102_REG_OUT1LMIX_INPUT_3_VOLUME                                0x0685
#define WM5102_REG_OUT1LMIX_INPUT_4_SOURCE                                0x0686
#define WM5102_REG_OUT1LMIX_INPUT_4_VOLUME                                0x0687
#define WM5102_REG_OUT1RMIX_INPUT_1_SOURCE                                0x0688
#define WM5102_REG_OUT1RMIX_INPUT_1_VOLUME                                0x0689
#define WM5102_REG_OUT1RMIX_INPUT_2_SOURCE                                0x068a
#define WM5102_REG_OUT1RMIX_INPUT_2_VOLUME                                0x068b
#define WM5102_REG_OUT1RMIX_INPUT_3_SOURCE                                0x068c
#define WM5102_REG_OUT1RMIX_INPUT_3_VOLUME                                0x068d
#define WM5102_REG_OUT1RMIX_INPUT_4_SOURCE                                0x068e
#define WM5102_REG_OUT1RMIX_INPUT_4_VOLUME                                0x068f
#define WM5102_REG_OUT2LMIX_INPUT_1_SOURCE                                0x0690
#define WM5102_REG_OUT2LMIX_INPUT_1_VOLUME                                0x0691
#define WM5102_REG_OUT2LMIX_INPUT_2_SOURCE                                0x0692
#define WM5102_REG_OUT2LMIX_INPUT_2_VOLUME                                0x0693
