joaoantoniocardoso/stm32f4_softcomp/system/src/Components/wm5102/wm5102_register_map.h
#define WM5102_REG_OUT2LMIX_INPUT_3_SOURCE                                0x0694
#define WM5102_REG_OUT2LMIX_INPUT_3_VOLUME                                0x0695
#define WM5102_REG_OUT2LMIX_INPUT_4_SOURCE                                0x0696
#define WM5102_REG_OUT2LMIX_INPUT_4_VOLUME                                0x0697
#define WM5102_REG_OUT2RMIX_INPUT_1_SOURCE                                0x0698
#define WM5102_REG_OUT2RMIX_INPUT_1_VOLUME                                0x0699
#define WM5102_REG_OUT2RMIX_INPUT_2_SOURCE                                0x069a
#define WM5102_REG_OUT2RMIX_INPUT_2_VOLUME                                0x069b
#define WM5102_REG_OUT2RMIX_INPUT_3_SOURCE                                0x069c
#define WM5102_REG_OUT2RMIX_INPUT_3_VOLUME                                0x069d
#define WM5102_REG_OUT2RMIX_INPUT_4_SOURCE                                0x069e
#define WM5102_REG_OUT2RMIX_INPUT_4_VOLUME                                0x069f
#define WM5102_REG_OUT3LMIX_INPUT_1_SOURCE                                0x06a0
#define WM5102_REG_OUT3LMIX_INPUT_1_VOLUME                                0x06a1
#define WM5102_REG_OUT3LMIX_INPUT_2_SOURCE                                0x06a2
#define WM5102_REG_OUT3LMIX_INPUT_2_VOLUME                                0x06a3
#define WM5102_REG_OUT3LMIX_INPUT_3_SOURCE                                0x06a4
#define WM5102_REG_OUT3LMIX_INPUT_3_VOLUME                                0x06a5
#define WM5102_REG_OUT3LMIX_INPUT_4_SOURCE                                0x06a6
#define WM5102_REG_OUT3LMIX_INPUT_4_VOLUME                                0x06a7
#define WM5102_REG_OUT4LMIX_INPUT_1_SOURCE                                0x06b0
#define WM5102_REG_OUT4LMIX_INPUT_1_VOLUME                                0x06b1
#define WM5102_REG_OUT4LMIX_INPUT_2_SOURCE                                0x06b2
#define WM5102_REG_OUT4LMIX_INPUT_2_VOLUME                                0x06b3
#define WM5102_REG_OUT4LMIX_INPUT_3_SOURCE                                0x06b4
#define WM5102_REG_OUT4LMIX_INPUT_3_VOLUME                                0x06b5
#define WM5102_REG_OUT4LMIX_INPUT_4_SOURCE                                0x06b6
#define WM5102_REG_OUT4LMIX_INPUT_4_VOLUME                                0x06b7
#define WM5102_REG_OUT4RMIX_INPUT_1_SOURCE                                0x06b8
#define WM5102_REG_OUT4RMIX_INPUT_1_VOLUME                                0x06b9
#define WM5102_REG_OUT4RMIX_INPUT_2_SOURCE                                0x06ba
#define WM5102_REG_OUT4RMIX_INPUT_2_VOLUME                                0x06bb
#define WM5102_REG_OUT4RMIX_INPUT_3_SOURCE                                0x06bc
#define WM5102_REG_OUT4RMIX_INPUT_3_VOLUME                                0x06bd
#define WM5102_REG_OUT4RMIX_INPUT_4_SOURCE                                0x06be
#define WM5102_REG_OUT4RMIX_INPUT_4_VOLUME                                0x06bf
#define WM5102_REG_OUT5LMIX_INPUT_1_SOURCE                                0x06c0
#define WM5102_REG_OUT5LMIX_INPUT_1_VOLUME                                0x06c1
#define WM5102_REG_OUT5LMIX_INPUT_2_SOURCE                                0x06c2
#define WM5102_REG_OUT5LMIX_INPUT_2_VOLUME                                0x06c3
#define WM5102_REG_OUT5LMIX_INPUT_3_SOURCE                                0x06c4
#define WM5102_REG_OUT5LMIX_INPUT_3_VOLUME                                0x06c5
#define WM5102_REG_OUT5LMIX_INPUT_4_SOURCE                                0x06c6
#define WM5102_REG_OUT5LMIX_INPUT_4_VOLUME                                0x06c7
#define WM5102_REG_OUT5RMIX_INPUT_1_SOURCE                                0x06c8
#define WM5102_REG_OUT5RMIX_INPUT_1_VOLUME                                0x06c9
#define WM5102_REG_OUT5RMIX_INPUT_2_SOURCE                                0x06ca
#define WM5102_REG_OUT5RMIX_INPUT_2_VOLUME                                0x06cb
#define WM5102_REG_OUT5RMIX_INPUT_3_SOURCE                                0x06cc
#define WM5102_REG_OUT5RMIX_INPUT_3_VOLUME                                0x06cd
#define WM5102_REG_OUT5RMIX_INPUT_4_SOURCE                                0x06ce
#define WM5102_REG_OUT5RMIX_INPUT_4_VOLUME                                0x06cf
#define WM5102_REG_AIF1TX1MIX_INPUT_1_SOURCE                              0x0700
#define WM5102_REG_AIF1TX1MIX_INPUT_1_VOLUME                              0x0701
#define WM5102_REG_AIF1TX1MIX_INPUT_2_SOURCE                              0x0702
#define WM5102_REG_AIF1TX1MIX_INPUT_2_VOLUME                              0x0703
#define WM5102_REG_AIF1TX1MIX_INPUT_3_SOURCE                              0x0704
#define WM5102_REG_AIF1TX1MIX_INPUT_3_VOLUME                              0x0705
#define WM5102_REG_AIF1TX1MIX_INPUT_4_SOURCE                              0x0706
#define WM5102_REG_AIF1TX1MIX_INPUT_4_VOLUME                              0x0707
#define WM5102_REG_AIF1TX2MIX_INPUT_1_SOURCE                              0x0708
#define WM5102_REG_AIF1TX2MIX_INPUT_1_VOLUME                              0x0709
#define WM5102_REG_AIF1TX2MIX_INPUT_2_SOURCE                              0x070a
#define WM5102_REG_AIF1TX2MIX_INPUT_2_VOLUME                              0x070b
#define WM5102_REG_AIF1TX2MIX_INPUT_3_SOURCE                              0x070c
#define WM5102_REG_AIF1TX2MIX_INPUT_3_VOLUME                              0x070d
#define WM5102_REG_AIF1TX2MIX_INPUT_4_SOURCE                              0x070e
#define WM5102_REG_AIF1TX2MIX_INPUT_4_VOLUME                              0x070f
#define WM5102_REG_AIF1TX3MIX_INPUT_1_SOURCE                              0x0710
#define WM5102_REG_AIF1TX3MIX_INPUT_1_VOLUME                              0x0711
#define WM5102_REG_AIF1TX3MIX_INPUT_2_SOURCE                              0x0712
#define WM5102_REG_AIF1TX3MIX_INPUT_2_VOLUME                              0x0713
#define WM5102_REG_AIF1TX3MIX_INPUT_3_SOURCE                              0x0714
#define WM5102_REG_AIF1TX3MIX_INPUT_3_VOLUME                              0x0715
#define WM5102_REG_AIF1TX3MIX_INPUT_4_SOURCE                              0x0716
#define WM5102_REG_AIF1TX3MIX_INPUT_4_VOLUME                              0x0717
#define WM5102_REG_AIF1TX4MIX_INPUT_1_SOURCE                              0x0718
#define WM5102_REG_AIF1TX4MIX_INPUT_1_VOLUME                              0x0719
#define WM5102_REG_AIF1TX4MIX_INPUT_2_SOURCE                              0x071a
#define WM5102_REG_AIF1TX4MIX_INPUT_2_VOLUME                              0x071b
#define WM5102_REG_AIF1TX4MIX_INPUT_3_SOURCE                              0x071c
#define WM5102_REG_AIF1TX4MIX_INPUT_3_VOLUME                              0x071d
#define WM5102_REG_AIF1TX4MIX_INPUT_4_SOURCE                              0x071e
#define WM5102_REG_AIF1TX4MIX_INPUT_4_VOLUME                              0x071f
#define WM5102_REG_AIF1TX5MIX_INPUT_1_SOURCE                              0x0720
#define WM5102_REG_AIF1TX5MIX_INPUT_1_VOLUME                              0x0721
#define WM5102_REG_AIF1TX5MIX_INPUT_2_SOURCE                              0x0722
#define WM5102_REG_AIF1TX5MIX_INPUT_2_VOLUME                              0x0723
#define WM5102_REG_AIF1TX5MIX_INPUT_3_SOURCE                              0x0724
#define WM5102_REG_AIF1TX5MIX_INPUT_3_VOLUME                              0x0725
#define WM5102_REG_AIF1TX5MIX_INPUT_4_SOURCE                              0x0726
#define WM5102_REG_AIF1TX5MIX_INPUT_4_VOLUME                              0x0727
#define WM5102_REG_AIF1TX6MIX_INPUT_1_SOURCE                              0x0728
#define WM5102_REG_AIF1TX6MIX_INPUT_1_VOLUME                              0x0729
#define WM5102_REG_AIF1TX6MIX_INPUT_2_SOURCE                              0x072a
#define WM5102_REG_AIF1TX6MIX_INPUT_2_VOLUME                              0x072b
#define WM5102_REG_AIF1TX6MIX_INPUT_3_SOURCE                              0x072c
#define WM5102_REG_AIF1TX6MIX_INPUT_3_VOLUME                              0x072d
#define WM5102_REG_AIF1TX6MIX_INPUT_4_SOURCE                              0x072e
#define WM5102_REG_AIF1TX6MIX_INPUT_4_VOLUME                              0x072f
#define WM5102_REG_AIF1TX7MIX_INPUT_1_SOURCE                              0x0730
#define WM5102_REG_AIF1TX7MIX_INPUT_1_VOLUME                              0x0731
#define WM5102_REG_AIF1TX7MIX_INPUT_2_SOURCE                              0x0732
#define WM5102_REG_AIF1TX7MIX_INPUT_2_VOLUME                              0x0733
#define WM5102_REG_AIF1TX7MIX_INPUT_3_SOURCE                              0x0734
#define WM5102_REG_AIF1TX7MIX_INPUT_3_VOLUME                              0x0735
#define WM5102_REG_AIF1TX7MIX_INPUT_4_SOURCE                              0x0736
#define WM5102_REG_AIF1TX7MIX_INPUT_4_VOLUME                              0x0737
#define WM5102_REG_AIF1TX8MIX_INPUT_1_SOURCE                              0x0738
#define WM5102_REG_AIF1TX8MIX_INPUT_1_VOLUME                              0x0739
#define WM5102_REG_AIF1TX8MIX_INPUT_2_SOURCE                              0x073a
#define WM5102_REG_AIF1TX8MIX_INPUT_2_VOLUME                              0x073b
#define WM5102_REG_AIF1TX8MIX_INPUT_3_SOURCE                              0x073c
#define WM5102_REG_AIF1TX8MIX_INPUT_3_VOLUME                              0x073d
#define WM5102_REG_AIF1TX8MIX_INPUT_4_SOURCE                              0x073e
#define WM5102_REG_AIF1TX8MIX_INPUT_4_VOLUME                              0x073f
#define WM5102_REG_AIF2TX1MIX_INPUT_1_SOURCE                              0x0740
#define WM5102_REG_AIF2TX1MIX_INPUT_1_VOLUME                              0x0741
#define WM5102_REG_AIF2TX1MIX_INPUT_2_SOURCE                              0x0742
#define WM5102_REG_AIF2TX1MIX_INPUT_2_VOLUME                              0x0743
#define WM5102_REG_AIF2TX1MIX_INPUT_3_SOURCE                              0x0744
#define WM5102_REG_AIF2TX1MIX_INPUT_3_VOLUME                              0x0745
#define WM5102_REG_AIF2TX1MIX_INPUT_4_SOURCE                              0x0746
#define WM5102_REG_AIF2TX1MIX_INPUT_4_VOLUME                              0x0747
#define WM5102_REG_AIF2TX2MIX_INPUT_1_SOURCE                              0x0748
#define WM5102_REG_AIF2TX2MIX_INPUT_1_VOLUME                              0x0749
#define WM5102_REG_AIF2TX2MIX_INPUT_2_SOURCE                              0x074a
#define WM5102_REG_AIF2TX2MIX_INPUT_2_VOLUME                              0x074b
#define WM5102_REG_AIF2TX2MIX_INPUT_3_SOURCE                              0x074c
#define WM5102_REG_AIF2TX2MIX_INPUT_3_VOLUME                              0x074d
#define WM5102_REG_AIF2TX2MIX_INPUT_4_SOURCE                              0x074e
#define WM5102_REG_AIF2TX2MIX_INPUT_4_VOLUME                              0x074f
#define WM5102_REG_AIF3TX1MIX_INPUT_1_SOURCE                              0x0780
#define WM5102_REG_AIF3TX1MIX_INPUT_1_VOLUME                              0x0781
#define WM5102_REG_AIF3TX1MIX_INPUT_2_SOURCE                              0x0782
#define WM5102_REG_AIF3TX1MIX_INPUT_2_VOLUME                              0x0783
#define WM5102_REG_AIF3TX1MIX_INPUT_3_SOURCE                              0x0784
#define WM5102_REG_AIF3TX1MIX_INPUT_3_VOLUME                              0x0785
#define WM5102_REG_AIF3TX1MIX_INPUT_4_SOURCE                              0x0786
#define WM5102_REG_AIF3TX1MIX_INPUT_4_VOLUME                              0x0787
#define WM5102_REG_AIF3TX2MIX_INPUT_1_SOURCE                              0x0788
#define WM5102_REG_AIF3TX2MIX_INPUT_1_VOLUME                              0x0789
#define WM5102_REG_AIF3TX2MIX_INPUT_2_SOURCE                              0x078a
#define WM5102_REG_AIF3TX2MIX_INPUT_2_VOLUME                              0x078b
#define WM5102_REG_AIF3TX2MIX_INPUT_3_SOURCE                              0x078c
#define WM5102_REG_AIF3TX2MIX_INPUT_3_VOLUME                              0x078d
#define WM5102_REG_AIF3TX2MIX_INPUT_4_SOURCE                              0x078e
#define WM5102_REG_AIF3TX2MIX_INPUT_4_VOLUME                              0x078f
#define WM5102_REG_SLIMTX1MIX_INPUT_1_SOURCE                              0x07c0
#define WM5102_REG_SLIMTX1MIX_INPUT_1_VOLUME                              0x07c1
#define WM5102_REG_SLIMTX1MIX_INPUT_2_SOURCE                              0x07c2
#define WM5102_REG_SLIMTX1MIX_INPUT_2_VOLUME                              0x07c3
#define WM5102_REG_SLIMTX1MIX_INPUT_3_SOURCE                              0x07c4
#define WM5102_REG_SLIMTX1MIX_INPUT_3_VOLUME                              0x07c5
#define WM5102_REG_SLIMTX1MIX_INPUT_4_SOURCE                              0x07c6
#define WM5102_REG_SLIMTX1MIX_INPUT_4_VOLUME                              0x07c7
#define WM5102_REG_SLIMTX2MIX_INPUT_1_SOURCE                              0x07c8
#define WM5102_REG_SLIMTX2MIX_INPUT_1_VOLUME                              0x07c9
#define WM5102_REG_SLIMTX2MIX_INPUT_2_SOURCE                              0x07ca
#define WM5102_REG_SLIMTX2MIX_INPUT_2_VOLUME                              0x07cb
#define WM5102_REG_SLIMTX2MIX_INPUT_3_SOURCE                              0x07cc
#define WM5102_REG_SLIMTX2MIX_INPUT_3_VOLUME                              0x07cd
#define WM5102_REG_SLIMTX2MIX_INPUT_4_SOURCE                              0x07ce
#define WM5102_REG_SLIMTX2MIX_INPUT_4_VOLUME                              0x07cf
#define WM5102_REG_SLIMTX3MIX_INPUT_1_SOURCE                              0x07d0
#define WM5102_REG_SLIMTX3MIX_INPUT_1_VOLUME                              0x07d1
#define WM5102_REG_SLIMTX3MIX_INPUT_2_SOURCE                              0x07d2
#define WM5102_REG_SLIMTX3MIX_INPUT_2_VOLUME                              0x07d3
#define WM5102_REG_SLIMTX3MIX_INPUT_3_SOURCE                              0x07d4
#define WM5102_REG_SLIMTX3MIX_INPUT_3_VOLUME                              0x07d5
#define WM5102_REG_SLIMTX3MIX_INPUT_4_SOURCE                              0x07d6
#define WM5102_REG_SLIMTX3MIX_INPUT_4_VOLUME                              0x07d7
#define WM5102_REG_SLIMTX4MIX_INPUT_1_SOURCE                              0x07d8
#define WM5102_REG_SLIMTX4MIX_INPUT_1_VOLUME                              0x07d9
#define WM5102_REG_SLIMTX4MIX_INPUT_2_SOURCE                              0x07da
#define WM5102_REG_SLIMTX4MIX_INPUT_2_VOLUME                              0x07db
#define WM5102_REG_SLIMTX4MIX_INPUT_3_SOURCE                              0x07dc
#define WM5102_REG_SLIMTX4MIX_INPUT_3_VOLUME                              0x07dd
#define WM5102_REG_SLIMTX4MIX_INPUT_4_SOURCE                              0x07de
#define WM5102_REG_SLIMTX4MIX_INPUT_4_VOLUME                              0x07df
#define WM5102_REG_SLIMTX5MIX_INPUT_1_SOURCE                              0x07e0
#define WM5102_REG_SLIMTX5MIX_INPUT_1_VOLUME                              0x07e1
#define WM5102_REG_SLIMTX5MIX_INPUT_2_SOURCE                              0x07e2
#define WM5102_REG_SLIMTX5MIX_INPUT_2_VOLUME                              0x07e3
#define WM5102_REG_SLIMTX5MIX_INPUT_3_SOURCE                              0x07e4
#define WM5102_REG_SLIMTX5MIX_INPUT_3_VOLUME                              0x07e5
#define WM5102_REG_SLIMTX5MIX_INPUT_4_SOURCE                              0x07e6
#define WM5102_REG_SLIMTX5MIX_INPUT_4_VOLUME                              0x07e7
#define WM5102_REG_SLIMTX6MIX_INPUT_1_SOURCE                              0x07e8
#define WM5102_REG_SLIMTX6MIX_INPUT_1_VOLUME                              0x07e9
#define WM5102_REG_SLIMTX6MIX_INPUT_2_SOURCE                              0x07ea
#define WM5102_REG_SLIMTX6MIX_INPUT_2_VOLUME                              0x07eb
#define WM5102_REG_SLIMTX6MIX_INPUT_3_SOURCE                              0x07ec
#define WM5102_REG_SLIMTX6MIX_INPUT_3_VOLUME                              0x07ed
#define WM5102_REG_SLIMTX6MIX_INPUT_4_SOURCE                              0x07ee
#define WM5102_REG_SLIMTX6MIX_INPUT_4_VOLUME                              0x07ef
#define WM5102_REG_SLIMTX7MIX_INPUT_1_SOURCE                              0x07f0
#define WM5102_REG_SLIMTX7MIX_INPUT_1_VOLUME                              0x07f1
#define WM5102_REG_SLIMTX7MIX_INPUT_2_SOURCE                              0x07f2
#define WM5102_REG_SLIMTX7MIX_INPUT_2_VOLUME                              0x07f3
#define WM5102_REG_SLIMTX7MIX_INPUT_3_SOURCE                              0x07f4
#define WM5102_REG_SLIMTX7MIX_INPUT_3_VOLUME                              0x07f5
#define WM5102_REG_SLIMTX7MIX_INPUT_4_SOURCE                              0x07f6
#define WM5102_REG_SLIMTX7MIX_INPUT_4_VOLUME                              0x07f7
#define WM5102_REG_SLIMTX8MIX_INPUT_1_SOURCE                              0x07f8
#define WM5102_REG_SLIMTX8MIX_INPUT_1_VOLUME                              0x07f9
#define WM5102_REG_SLIMTX8MIX_INPUT_2_SOURCE                              0x07fa
#define WM5102_REG_SLIMTX8MIX_INPUT_2_VOLUME                              0x07fb
#define WM5102_REG_SLIMTX8MIX_INPUT_3_SOURCE                              0x07fc
#define WM5102_REG_SLIMTX8MIX_INPUT_3_VOLUME                              0x07fd
#define WM5102_REG_SLIMTX8MIX_INPUT_4_SOURCE                              0x07fe
#define WM5102_REG_SLIMTX8MIX_INPUT_4_VOLUME                              0x07ff
#define WM5102_REG_EQ1MIX_INPUT_1_SOURCE                                  0x0880
#define WM5102_REG_EQ1MIX_INPUT_1_VOLUME                                  0x0881
#define WM5102_REG_EQ1MIX_INPUT_2_SOURCE                                  0x0882
#define WM5102_REG_EQ1MIX_INPUT_2_VOLUME                                  0x0883
#define WM5102_REG_EQ1MIX_INPUT_3_SOURCE                                  0x0884
#define WM5102_REG_EQ1MIX_INPUT_3_VOLUME                                  0x0885
#define WM5102_REG_EQ1MIX_INPUT_4_SOURCE                                  0x0886
#define WM5102_REG_EQ1MIX_INPUT_4_VOLUME                                  0x0887
#define WM5102_REG_EQ2MIX_INPUT_1_SOURCE                                  0x0888
#define WM5102_REG_EQ2MIX_INPUT_1_VOLUME                                  0x0889
#define WM5102_REG_EQ2MIX_INPUT_2_SOURCE                                  0x088a
#define WM5102_REG_EQ2MIX_INPUT_2_VOLUME                                  0x088b
#define WM5102_REG_EQ2MIX_INPUT_3_SOURCE                                  0x088c
#define WM5102_REG_EQ2MIX_INPUT_3_VOLUME                                  0x088d
#define WM5102_REG_EQ2MIX_INPUT_4_SOURCE                                  0x088e
#define WM5102_REG_EQ2MIX_INPUT_4_VOLUME                                  0x088f
#define WM5102_REG_EQ3MIX_INPUT_1_SOURCE                                  0x0890
#define WM5102_REG_EQ3MIX_INPUT_1_VOLUME                                  0x0891
#define WM5102_REG_EQ3MIX_INPUT_2_SOURCE                                  0x0892
#define WM5102_REG_EQ3MIX_INPUT_2_VOLUME                                  0x0893
#define WM5102_REG_EQ3MIX_INPUT_3_SOURCE                                  0x0894
#define WM5102_REG_EQ3MIX_INPUT_3_VOLUME                                  0x0895
#define WM5102_REG_EQ3MIX_INPUT_4_SOURCE                                  0x0896
#define WM5102_REG_EQ3MIX_INPUT_4_VOLUME                                  0x0897
#define WM5102_REG_EQ4MIX_INPUT_1_SOURCE                                  0x0898
#define WM5102_REG_EQ4MIX_INPUT_1_VOLUME                                  0x0899
#define WM5102_REG_EQ4MIX_INPUT_2_SOURCE                                  0x089a
#define WM5102_REG_EQ4MIX_INPUT_2_VOLUME                                  0x089b
#define WM5102_REG_EQ4MIX_INPUT_3_SOURCE                                  0x089c
#define WM5102_REG_EQ4MIX_INPUT_3_VOLUME                                  0x089d
#define WM5102_REG_EQ4MIX_INPUT_4_SOURCE                                  0x089e
#define WM5102_REG_EQ4MIX_INPUT_4_VOLUME                                  0x089f
#define WM5102_REG_DRC1LMIX_INPUT_1_SOURCE                                0x08c0
#define WM5102_REG_DRC1LMIX_INPUT_1_VOLUME                                0x08c1
#define WM5102_REG_DRC1LMIX_INPUT_2_SOURCE                                0x08c2
#define WM5102_REG_DRC1LMIX_INPUT_2_VOLUME                                0x08c3
#define WM5102_REG_DRC1LMIX_INPUT_3_SOURCE                                0x08c4
#define WM5102_REG_DRC1LMIX_INPUT_3_VOLUME                                0x08c5
#define WM5102_REG_DRC1LMIX_INPUT_4_SOURCE                                0x08c6
#define WM5102_REG_DRC1LMIX_INPUT_4_VOLUME                                0x08c7
#define WM5102_REG_DRC1RMIX_INPUT_1_SOURCE                                0x08c8
#define WM5102_REG_DRC1RMIX_INPUT_1_VOLUME                                0x08c9
#define WM5102_REG_DRC1RMIX_INPUT_2_SOURCE                                0x08ca
#define WM5102_REG_DRC1RMIX_INPUT_2_VOLUME                                0x08cb
#define WM5102_REG_DRC1RMIX_INPUT_3_SOURCE                                0x08cc
#define WM5102_REG_DRC1RMIX_INPUT_3_VOLUME                                0x08cd
#define WM5102_REG_DRC1RMIX_INPUT_4_SOURCE                                0x08ce
#define WM5102_REG_DRC1RMIX_INPUT_4_VOLUME                                0x08cf
#define WM5102_REG_HPLP1MIX_INPUT_1_SOURCE                                0x0900
#define WM5102_REG_HPLP1MIX_INPUT_1_VOLUME                                0x0901
#define WM5102_REG_HPLP1MIX_INPUT_2_SOURCE                                0x0902
#define WM5102_REG_HPLP1MIX_INPUT_2_VOLUME                                0x0903
#define WM5102_REG_HPLP1MIX_INPUT_3_SOURCE                                0x0904
#define WM5102_REG_HPLP1MIX_INPUT_3_VOLUME                                0x0905
#define WM5102_REG_HPLP1MIX_INPUT_4_SOURCE                                0x0906
#define WM5102_REG_HPLP1MIX_INPUT_4_VOLUME                                0x0907
#define WM5102_REG_HPLP2MIX_INPUT_1_SOURCE                                0x0908
#define WM5102_REG_HPLP2MIX_INPUT_1_VOLUME                                0x0909
#define WM5102_REG_HPLP2MIX_INPUT_2_SOURCE                                0x090a
#define WM5102_REG_HPLP2MIX_INPUT_2_VOLUME                                0x090b
#define WM5102_REG_HPLP2MIX_INPUT_3_SOURCE                                0x090c
#define WM5102_REG_HPLP2MIX_INPUT_3_VOLUME                                0x090d
#define WM5102_REG_HPLP2MIX_INPUT_4_SOURCE                                0x090e
#define WM5102_REG_HPLP2MIX_INPUT_4_VOLUME                                0x090f
#define WM5102_REG_HPLP3MIX_INPUT_1_SOURCE                                0x0910
#define WM5102_REG_HPLP3MIX_INPUT_1_VOLUME                                0x0911
#define WM5102_REG_HPLP3MIX_INPUT_2_SOURCE                                0x0912
#define WM5102_REG_HPLP3MIX_INPUT_2_VOLUME                                0x0913
#define WM5102_REG_HPLP3MIX_INPUT_3_SOURCE                                0x0914
#define WM5102_REG_HPLP3MIX_INPUT_3_VOLUME                                0x0915
#define WM5102_REG_HPLP3MIX_INPUT_4_SOURCE                                0x0916
#define WM5102_REG_HPLP3MIX_INPUT_4_VOLUME                                0x0917
#define WM5102_REG_HPLP4MIX_INPUT_1_SOURCE                                0x0918
#define WM5102_REG_HPLP4MIX_INPUT_1_VOLUME                                0x0919
#define WM5102_REG_HPLP4MIX_INPUT_2_SOURCE                                0x091a
#define WM5102_REG_HPLP4MIX_INPUT_2_VOLUME                                0x091b
#define WM5102_REG_HPLP4MIX_INPUT_3_SOURCE                                0x091c
#define WM5102_REG_HPLP4MIX_INPUT_3_VOLUME                                0x091d
#define WM5102_REG_HPLP4MIX_INPUT_4_SOURCE                                0x091e
#define WM5102_REG_HPLP4MIX_INPUT_4_VOLUME                                0x091f
#define WM5102_REG_DSP1LMIX_INPUT_1_SOURCE                                0x0940
#define WM5102_REG_DSP1LMIX_INPUT_1_VOLUME                                0x0941
#define WM5102_REG_DSP1LMIX_INPUT_2_SOURCE                                0x0942
#define WM5102_REG_DSP1LMIX_INPUT_2_VOLUME                                0x0943
