joaoantoniocardoso/stm32f4_softcomp/system/src/Components/wm5102/wm5102_register_map.h
#define WM5102_REG_DSP1LMIX_INPUT_3_SOURCE                                0x0944
#define WM5102_REG_DSP1LMIX_INPUT_3_VOLUME                                0x0945
#define WM5102_REG_DSP1LMIX_INPUT_4_SOURCE                                0x0946
#define WM5102_REG_DSP1LMIX_INPUT_4_VOLUME                                0x0947
#define WM5102_REG_DSP1RMIX_INPUT_1_SOURCE                                0x0948
#define WM5102_REG_DSP1RMIX_INPUT_1_VOLUME                                0x0949
#define WM5102_REG_DSP1RMIX_INPUT_2_SOURCE                                0x094a
#define WM5102_REG_DSP1RMIX_INPUT_2_VOLUME                                0x094b
#define WM5102_REG_DSP1RMIX_INPUT_3_SOURCE                                0x094c
#define WM5102_REG_DSP1RMIX_INPUT_3_VOLUME                                0x094d
#define WM5102_REG_DSP1RMIX_INPUT_4_SOURCE                                0x094e
#define WM5102_REG_DSP1RMIX_INPUT_4_VOLUME                                0x094f
#define WM5102_REG_DSP1AUX1MIX_INPUT_1_SOURCE                             0x0950
#define WM5102_REG_DSP1AUX2MIX_INPUT_1_SOURCE                             0x0958
#define WM5102_REG_DSP1AUX3MIX_INPUT_1_SOURCE                             0x0960
#define WM5102_REG_DSP1AUX4MIX_INPUT_1_SOURCE                             0x0968
#define WM5102_REG_DSP1AUX5MIX_INPUT_1_SOURCE                             0x0970
#define WM5102_REG_DSP1AUX6MIX_INPUT_1_SOURCE                             0x0978
#define WM5102_REG_ASRC1LMIX_INPUT_1_SOURCE                               0x0a80
#define WM5102_REG_ASRC1RMIX_INPUT_1_SOURCE                               0x0a88
#define WM5102_REG_ASRC2LMIX_INPUT_1_SOURCE                               0x0a90
#define WM5102_REG_ASRC2RMIX_INPUT_1_SOURCE                               0x0a98
#define WM5102_REG_ISRC1DEC1MIX_INPUT_1_SOURCE                            0x0b00
#define WM5102_REG_ISRC1DEC2MIX_INPUT_1_SOURCE                            0x0b08
#define WM5102_REG_ISRC1INT1MIX_INPUT_1_SOURCE                            0x0b20
#define WM5102_REG_ISRC1INT2MIX_INPUT_1_SOURCE                            0x0b28
#define WM5102_REG_ISRC2DEC1MIX_INPUT_1_SOURCE                            0x0b40
#define WM5102_REG_ISRC2DEC2MIX_INPUT_1_SOURCE                            0x0b48
#define WM5102_REG_ISRC2INT1MIX_INPUT_1_SOURCE                            0x0b60
#define WM5102_REG_ISRC2INT2MIX_INPUT_1_SOURCE                            0x0b68
#define WM5102_REG_GPIO1_CTRL                                             0x0c00
#define WM5102_REG_GPIO2_CTRL                                             0x0c01
#define WM5102_REG_GPIO3_CTRL                                             0x0c02
#define WM5102_REG_GPIO4_CTRL                                             0x0c03
#define WM5102_REG_GPIO5_CTRL                                             0x0c04
#define WM5102_REG_IRQ_CTRL_1                                             0x0c0f
#define WM5102_REG_GPIO_DEBOUNCE_CONFIG                                   0x0c10
#define WM5102_REG_MISC_PAD_CTRL_1                                        0x0c20
#define WM5102_REG_MISC_PAD_CTRL_2                                        0x0c21
#define WM5102_REG_MISC_PAD_CTRL_3                                        0x0c22
#define WM5102_REG_MISC_PAD_CTRL_4                                        0x0c23
#define WM5102_REG_MISC_PAD_CTRL_5                                        0x0c24
#define WM5102_REG_MISC_PAD_CTRL_6                                        0x0c25
#define WM5102_REG_INTERRUPT_STATUS_1                                     0x0d00
#define WM5102_REG_INTERRUPT_STATUS_2                                     0x0d01
#define WM5102_REG_INTERRUPT_STATUS_3                                     0x0d02
#define WM5102_REG_INTERRUPT_STATUS_4                                     0x0d03
#define WM5102_REG_INTERRUPT_STATUS_5                                     0x0d04
#define WM5102_REG_INTERRUPT_STATUS_1_MASK                                0x0d08
#define WM5102_REG_INTERRUPT_STATUS_2_MASK                                0x0d09
#define WM5102_REG_INTERRUPT_STATUS_3_MASK                                0x0d0a
#define WM5102_REG_INTERRUPT_STATUS_4_MASK                                0x0d0b
#define WM5102_REG_INTERRUPT_STATUS_5_MASK                                0x0d0c
#define WM5102_REG_INTERRUPT_CONTROL                                      0x0d0f
#define WM5102_REG_IRQ2_STATUS_1                                          0x0d10
#define WM5102_REG_IRQ2_STATUS_2                                          0x0d11
#define WM5102_REG_IRQ2_STATUS_3                                          0x0d12
#define WM5102_REG_IRQ2_STATUS_4                                          0x0d13
#define WM5102_REG_IRQ2_STATUS_5                                          0x0d14
#define WM5102_REG_IRQ2_STATUS_1_MASK                                     0x0d18
#define WM5102_REG_IRQ2_STATUS_2_MASK                                     0x0d19
#define WM5102_REG_IRQ2_STATUS_3_MASK                                     0x0d1a
#define WM5102_REG_IRQ2_STATUS_4_MASK                                     0x0d1b
#define WM5102_REG_IRQ2_STATUS_5_MASK                                     0x0d1c
#define WM5102_REG_IRQ2_CONTROL                                           0x0d1f
#define WM5102_REG_INTERRUPT_RAW_STATUS_2                                 0x0d20
#define WM5102_REG_INTERRUPT_RAW_STATUS_3                                 0x0d21
#define WM5102_REG_INTERRUPT_RAW_STATUS_4                                 0x0d22
#define WM5102_REG_INTERRUPT_RAW_STATUS_5                                 0x0d23
#define WM5102_REG_INTERRUPT_RAW_STATUS_6                                 0x0d24
#define WM5102_REG_INTERRUPT_RAW_STATUS_7                                 0x0d25
#define WM5102_REG_INTERRUPT_RAW_STATUS_8                                 0x0d26
#define WM5102_REG_IRQ_PIN_STATUS                                         0x0d40
#define WM5102_REG_AOD_WKUP_AND_TRIG                                      0x0d50
#define WM5102_REG_AOD_IRQ1                                               0x0d51
#define WM5102_REG_AOD_IRQ2                                               0x0d52
#define WM5102_REG_AOD_IRQ_MASK_IRQ1                                      0x0d53
#define WM5102_REG_AOD_IRQ_MASK_IRQ2                                      0x0d54
#define WM5102_REG_AOD_IRQ_RAW_STATUS                                     0x0d55
#define WM5102_REG_JACK_DETECT_DEBOUNCE                                   0x0d56
#define WM5102_REG_FX_CTRL1                                               0x0e00
#define WM5102_REG_FX_CTRL2                                               0x0e01
#define WM5102_REG_EQ1_1                                                  0x0e10
#define WM5102_REG_EQ1_2                                                  0x0e11
#define WM5102_REG_EQ1_3                                                  0x0e12
#define WM5102_REG_EQ1_4                                                  0x0e13
#define WM5102_REG_EQ1_5                                                  0x0e14
#define WM5102_REG_EQ1_6                                                  0x0e15
#define WM5102_REG_EQ1_7                                                  0x0e16
#define WM5102_REG_EQ1_8                                                  0x0e17
#define WM5102_REG_EQ1_9                                                  0x0e18
#define WM5102_REG_EQ1_10                                                 0x0e19
#define WM5102_REG_EQ1_11                                                 0x0e1a
#define WM5102_REG_EQ1_12                                                 0x0e1b
#define WM5102_REG_EQ1_13                                                 0x0e1c
#define WM5102_REG_EQ1_14                                                 0x0e1d
#define WM5102_REG_EQ1_15                                                 0x0e1e
#define WM5102_REG_EQ1_16                                                 0x0e1f
#define WM5102_REG_EQ1_17                                                 0x0e20
#define WM5102_REG_EQ1_18                                                 0x0e21
#define WM5102_REG_EQ1_19                                                 0x0e22
#define WM5102_REG_EQ1_20                                                 0x0e23
#define WM5102_REG_EQ1_21                                                 0x0e24
#define WM5102_REG_EQ2_1                                                  0x0e26
#define WM5102_REG_EQ2_2                                                  0x0e27
#define WM5102_REG_EQ2_3                                                  0x0e28
#define WM5102_REG_EQ2_4                                                  0x0e29
#define WM5102_REG_EQ2_5                                                  0x0e2a
#define WM5102_REG_EQ2_6                                                  0x0e2b
#define WM5102_REG_EQ2_7                                                  0x0e2c
#define WM5102_REG_EQ2_8                                                  0x0e2d
#define WM5102_REG_EQ2_9                                                  0x0e2e
#define WM5102_REG_EQ2_10                                                 0x0e2f
#define WM5102_REG_EQ2_11                                                 0x0e30
#define WM5102_REG_EQ2_12                                                 0x0e31
#define WM5102_REG_EQ2_13                                                 0x0e32
#define WM5102_REG_EQ2_14                                                 0x0e33
#define WM5102_REG_EQ2_15                                                 0x0e34
#define WM5102_REG_EQ2_16                                                 0x0e35
#define WM5102_REG_EQ2_17                                                 0x0e36
#define WM5102_REG_EQ2_18                                                 0x0e37
#define WM5102_REG_EQ2_19                                                 0x0e38
#define WM5102_REG_EQ2_20                                                 0x0e39
#define WM5102_REG_EQ2_21                                                 0x0e3a
#define WM5102_REG_EQ3_1                                                  0x0e3c
#define WM5102_REG_EQ3_2                                                  0x0e3d
#define WM5102_REG_EQ3_3                                                  0x0e3e
#define WM5102_REG_EQ3_4                                                  0x0e3f
#define WM5102_REG_EQ3_5                                                  0x0e40
#define WM5102_REG_EQ3_6                                                  0x0e41
#define WM5102_REG_EQ3_7                                                  0x0e42
#define WM5102_REG_EQ3_8                                                  0x0e43
#define WM5102_REG_EQ3_9                                                  0x0e44
#define WM5102_REG_EQ3_10                                                 0x0e45
#define WM5102_REG_EQ3_11                                                 0x0e46
#define WM5102_REG_EQ3_12                                                 0x0e47
#define WM5102_REG_EQ3_13                                                 0x0e48
#define WM5102_REG_EQ3_14                                                 0x0e49
#define WM5102_REG_EQ3_15                                                 0x0e4a
#define WM5102_REG_EQ3_16                                                 0x0e4b
#define WM5102_REG_EQ3_17                                                 0x0e4c
#define WM5102_REG_EQ3_18                                                 0x0e4d
#define WM5102_REG_EQ3_19                                                 0x0e4e
#define WM5102_REG_EQ3_20                                                 0x0e4f
#define WM5102_REG_EQ3_21                                                 0x0e50
#define WM5102_REG_EQ4_1                                                  0x0e52
#define WM5102_REG_EQ4_2                                                  0x0e53
#define WM5102_REG_EQ4_3                                                  0x0e54
#define WM5102_REG_EQ4_4                                                  0x0e55
#define WM5102_REG_EQ4_5                                                  0x0e56
#define WM5102_REG_EQ4_6                                                  0x0e57
#define WM5102_REG_EQ4_7                                                  0x0e58
#define WM5102_REG_EQ4_8                                                  0x0e59
#define WM5102_REG_EQ4_9                                                  0x0e5a
#define WM5102_REG_EQ4_10                                                 0x0e5b
#define WM5102_REG_EQ4_11                                                 0x0e5c
#define WM5102_REG_EQ4_12                                                 0x0e5d
#define WM5102_REG_EQ4_13                                                 0x0e5e
#define WM5102_REG_EQ4_14                                                 0x0e5f
#define WM5102_REG_EQ4_15                                                 0x0e60
#define WM5102_REG_EQ4_16                                                 0x0e61
#define WM5102_REG_EQ4_17                                                 0x0e62
#define WM5102_REG_EQ4_18                                                 0x0e63
#define WM5102_REG_EQ4_19                                                 0x0e64
#define WM5102_REG_EQ4_20                                                 0x0e65
#define WM5102_REG_EQ4_21                                                 0x0e66
#define WM5102_REG_DRC1_CTRL1                                             0x0e80
#define WM5102_REG_DRC1_CTRL2                                             0x0e81
#define WM5102_REG_DRC1_CTRL3                                             0x0e82
#define WM5102_REG_DRC1_CTRL4                                             0x0e83
#define WM5102_REG_DRC1_CTRL5                                             0x0e84
#define WM5102_REG_HPLPF1_1                                               0x0ec0
#define WM5102_REG_HPLPF1_2                                               0x0ec1
#define WM5102_REG_HPLPF2_1                                               0x0ec4
#define WM5102_REG_HPLPF2_2                                               0x0ec5
#define WM5102_REG_HPLPF3_1                                               0x0ec8
#define WM5102_REG_HPLPF3_2                                               0x0ec9
#define WM5102_REG_HPLPF4_1                                               0x0ecc
#define WM5102_REG_HPLPF4_2                                               0x0ecd
#define WM5102_REG_ASRC_ENABLE                                            0x0ee0
#define WM5102_REG_ASRC_STATUS                                            0x0ee1
#define WM5102_REG_ASRC_RATE1                                             0x0ee2
#define WM5102_REG_ASRC_RATE2                                             0x0ee3
#define WM5102_REG_ISRC_1_CTRL_1                                          0x0ef0
#define WM5102_REG_ISRC_1_CTRL_2                                          0x0ef1
#define WM5102_REG_ISRC_1_CTRL_3                                          0x0ef2
#define WM5102_REG_ISRC_2_CTRL_1                                          0x0ef3
#define WM5102_REG_ISRC_2_CTRL_2                                          0x0ef4
#define WM5102_REG_ISRC_2_CTRL_3                                          0x0ef5
#define WM5102_REG_DSP1_CONTROL_1                                         0x1100
#define WM5102_REG_DSP1_CLOCKING_1                                        0x1101
#define WM5102_REG_DSP1_STATUS_1                                          0x1104
#define WM5102_REG_DSP1_STATUS_2                                          0x1105
#define WM5102_REG_DSP1_WDMA_BUFFER_1                                     0x1110
#define WM5102_REG_DSP1_WDMA_BUFFER_2                                     0x1111
#define WM5102_REG_DSP1_WDMA_BUFFER_3                                     0x1112
#define WM5102_REG_DSP1_WDMA_BUFFER_4                                     0x1113
#define WM5102_REG_DSP1_WDMA_BUFFER_5                                     0x1114
#define WM5102_REG_DSP1_WDMA_BUFFER_6                                     0x1115
#define WM5102_REG_DSP1_WDMA_BUFFER_7                                     0x1116
#define WM5102_REG_DSP1_WDMA_BUFFER_8                                     0x1117
#define WM5102_REG_DSP1_RDMA_BUFFER_1                                     0x1120
#define WM5102_REG_DSP1_RDMA_BUFFER_2                                     0x1121
#define WM5102_REG_DSP1_RDMA_BUFFER_3                                     0x1122
#define WM5102_REG_DSP1_RDMA_BUFFER_4                                     0x1123
#define WM5102_REG_DSP1_RDMA_BUFFER_5                                     0x1124
#define WM5102_REG_DSP1_RDMA_BUFFER_6                                     0x1125
#define WM5102_REG_DSP1_WDMA_CONFIG_1                                     0x1130
#define WM5102_REG_DSP1_WDMA_CONFIG_2                                     0x1131
#define WM5102_REG_DSP1_RDMA_CONFIG_1                                     0x1134
#define WM5102_REG_DSP1_SCRATCH_0                                         0x1140
#define WM5102_REG_DSP1_SCRATCH_1                                         0x1141
#define WM5102_REG_DSP1_SCRATCH_2                                         0x1142
#define WM5102_REG_DSP1_SCRATCH_3                                         0x1143
#define WM5102_REG_WSEQ_SEQUENCE_1                                        0x3000
#define WM5102_REG_WSEQ_SEQUENCE_2                                        0x3001
#define WM5102_REG_WSEQ_SEQUENCE_3                                        0x3002
#define WM5102_REG_WSEQ_SEQUENCE_4                                        0x3003
#define WM5102_REG_WSEQ_SEQUENCE_511                                      0x31fe
#define WM5102_REG_WSEQ_SEQUENCE_512                                      0x31ff
#define WM5102_REG_DSP1PM0                                            0x00100000
#define WM5102_REG_DSP1PM1                                            0x00100001
#define WM5102_REG_DSP1PM2                                            0x00100002
#define WM5102_REG_DSP1PM3                                            0x00100003
#define WM5102_REG_DSP1PM4                                            0x00100004
#define WM5102_REG_DSP1PM5                                            0x00100005
#define WM5102_REG_DSP1PM024573                                       0x00105ffd
#define WM5102_REG_DSP1PM24574                                        0x00105ffe
#define WM5102_REG_DSP1PM24575                                        0x00105fff
#define WM5102_REG_DSP1ZM0                                            0x00180000
#define WM5102_REG_DSP1ZM1                                            0x00180001
#define WM5102_REG_DSP1ZM2                                            0x00180002
#define WM5102_REG_DSP1ZM3                                            0x00180003
#define WM5102_REG_DSP1ZM2046                                         0x001807fe
#define WM5102_REG_DSP1ZM2047                                         0x001807ff
#define WM5102_REG_DSP1XM0                                            0x00190000
#define WM5102_REG_DSP1XM1                                            0x00190001
#define WM5102_REG_DSP1XM2                                            0x00190002
#define WM5102_REG_DSP1XM3                                            0x00190003
#define WM5102_REG_DSP1XM18430                                        0x001947fe
#define WM5102_REG_DSP1XM18431                                        0x001947ff
#define WM5102_REG_DSP1YM0                                            0x001a8000
#define WM5102_REG_DSP1YM1                                            0x001a8001
#define WM5102_REG_DSP1YM2                                            0x001a8002
#define WM5102_REG_DSP1YM3                                            0x001a8003
#define WM5102_REG_DSP1YM6142                                         0x001a97fe
#define WM5102_REG_DSP1YM6143                                         0x001a97ff
